In [1]:
import pandas as pd
users_table1=pd.read_csv("users_table1.csv",index_col=0)
users_table1.index=range(1,len(users_table1)+1)
users_table1

       Names  Age     Occupation  Salary    Location
1       Mary   37          Nurse  249944      Moscow
2       Jane   33   Data Analyst  121798      Mumbai
3    Hillary   37   Data Analyst  182773     Nairobi
4   Napoleon   35     Accountant  135904  Washington
5      Terry   26   Data Analyst  279187       Lagos
6       Mane   40     Accountant  190449     Nairobi
7       Sane   44  Sales Manager  144112  Burcharest
8    Mamadou   38          Nurse   80050      Warsaw
9     Claire   44          Nurse  245264        Oslo
10      Venn   42        Teacher  281013      Moscow
11      Hill   29          Nurse   69598        Oslo
12      Joan   36          Nurse  213230  Burcharest
13     Peter   32     Accountant  269219      Mumbai
14     James   42  Sales Manager   69932      Moscow
15      John   40          Clerk   74067       Lagos

In [2]:
#users table2
users_table2=pd.read_csv("users_table2.csv",index_col=0)
#reset index
users_table2.index=range(1,len(users_table2)+1)
users_table2

         Name  Age   Occupation  Salary Location
1      Amelia   30      Teacher   73278  Nairobi
2   Alexander   29      Plumber   83383   Tehran
3       Clark   40  Sales Agent   94349   Moscow
4     Everlyn   37        Pilot   65968   Tehran
5       Lopez   29      Teacher   82701   Mumbai
6      Lamine   31   Accountant   66782   Tehran
7      Fermin   38      Plumber   63144   Tehran
8        Diaz   25   Accountant   78931    Lagos
9       Dante   33        Pilot   66164    Lagos
10    Welbeck   41   Accountant   67250   Mumbai
11      Sisse   33        Pilot   78829   Mumbai
12       Pato   39        Pilot   90222   Moscow
13       Alex   36      Dentist   97382   Tehran
14    Mathias   35      Teacher   70221   Moscow
15       Mark   31   Accountant   88500  Nairobi